{
  "version": "2.0.0",
  "last_updated": "2024-10-24",
  "description": "增强版运势分析模板库 - 支持十神组合和节气的深度个性化运势分析",
  "template_count": 1200,
  "dimensions": ["十神关系", "五行强弱", "节气影响", "年龄段", "性别"],
  
  "fortune_analysis_matrix": {
    "十神关系运势": {
      "比肩": {
        "正面影响": {
          "基础描述": "今日比肩当值，代表同类相助的能量较强。您容易遇到志同道合的朋友或合作伙伴，在团队协作中能够发挥重要作用。",
          "事业运势": "工作中容易得到同事的支持和协助，团队项目进展顺利。适合参与集体决策和协作性工作。",
          "财运分析": "正财运平稳，适合与他人合作投资或理财。避免独自承担大额投资风险，团队理财效果更佳。",
          "人际关系": "朋友运旺盛，容易结识新朋友或加深现有友谊。适合参加社交活动和团体聚会。",
          "健康状况": "精神状态良好，体力充沛。适合进行团体运动或户外活动，注意保持规律作息。"
        },
        "注意事项": {
          "竞争压力": "比肩也代表竞争，在合作中要注意处理好利益分配问题，避免因小失大。",
          "决策建议": "重大决策建议多听取他人意见，但最终要有自己的主见，不要盲从。",
          "投资警示": "避免跟风投资，要有独立的判断能力。群体决策虽好，但要谨防集体盲目性。"
        },
        "年龄差异": {
          "25岁以下": "正值建立人际网络的重要时期，要珍惜每一个合作机会，学会在团队中发挥自己的优势。",
          "25-40岁": "事业发展的关键期，要善于利用同行资源和合作伙伴关系，但要保持自己的核心竞争力。",
          "40岁以上": "经验丰富，适合在团队中发挥领导和协调作用，传授经验的同时也要保持学习心态。"
        }
      },
      "劫财": {
        "负面影响": {
          "基础描述": "今日劫财当值，代表破财和竞争的能量较强。在财务管理和人际关系上需要格外谨慎，避免不必要的损失。",
          "财运警示": "有破财的风险，不宜进行大额投资或借贷。要警惕投资陷阱和金融诈骗，保守理财为宜。",
          "人际关系": "容易与他人发生利益冲突，要注意控制情绪，避免因钱财问题影响人际关系。",
          "工作事业": "工作中可能遇到竞争对手或阻力，要保持冷静，用实力说话，避免正面冲突。"
        },
        "化解建议": {
          "财务管理": "今日适合检查和整理财务状况，制定理财计划，但不宜执行重大投资决策。",
          "人际处理": "遇到冲突时要冷静分析，寻求双赢的解决方案，必要时可以寻求第三方调解。",
          "心态调整": "把挫折当作学习机会，增强风险意识和防范能力，为未来的发展积累经验。"
        },
        "性别差异": {
          "男性": "要控制好争强好胜的心理，在竞争中保持君子风度，避免因小失大。",
          "女性": "在理财和购物方面要更加理性，避免冲动消费，多比较和思考后再做决定。"
        }
      },
      "食神": {
        "创造力旺盛": {
          "基础描述": "今日食神当值，代表创造力和表达能力特别强。您的思维活跃，灵感丰富，适合进行创意性工作和艺术表达。",
          "创意工作": "在创作、设计、策划等工作中能够发挥出色，容易有突破性的想法和创新方案。",
          "学习运势": "学习能力强，理解力佳，适合学习新知识或技能。考试和培训都有不错的表现。",
          "表达沟通": "口才和文笔都很好，适合进行演讲、写作、教学等需要表达能力的活动。",
          "艺术天赋": "艺术细胞活跃，适合从事艺术创作、欣赏和交流活动。"
        },
        "实用建议": {
          "工作应用": "把创意想法及时记录下来，寻找合适的机会将其转化为实际成果。",
          "学习规划": "制定学习计划，选择感兴趣的课程或技能进行深入学习。",
          "社交活动": "参加文化艺术活动，与志趣相投的人交流，扩展人脉关系。"
        },
        "发展方向": {
          "短期目标": "完成一个创意项目或学会一项新技能，展示自己的才华和能力。",
          "长期规划": "在创意和表达领域建立自己的专业优势，形成独特的个人品牌。"
        }
      },
      "伤官": {
        "情绪波动": {
          "基础描述": "今日伤官当值，代表情绪起伏较大，表达欲强但容易冲动。需要注意控制情绪，谨慎言行。",
          "情绪管理": "容易因小事而情绪激动，要学会深呼吸和冷静思考，避免做出冲动的决定。",
          "人际交往": "说话要注意分寸，避免口无遮拦得罪他人。批评和建议要用委婉的方式表达。",
          "工作表现": "有很强的表达欲和表现欲，但要注意方式方法，避免过于张扬而招致反感。"
        },
        "正面引导": {
          "创新思维": "思维敏锐，善于发现问题和提出改进建议，可以在工作中发挥监督和改进的作用。",
          "才华展示": "适合进行技能展示和才艺表演，在合适的场合展现自己的专业能力。",
          "学习研究": "对新事物有强烈的好奇心，适合进行研究和探索性工作。"
        },
        "化解方法": {
          "运动释放": "通过适当的体育运动释放多余的能量，缓解情绪压力。",
          "艺术表达": "通过音乐、绘画、写作等艺术方式表达情感，化解内心的激动。",
          "冥想静心": "进行冥想或瑜伽等静心活动，培养内心的平静和专注。"
        }
      },
      "正财": {
        "财运亨通": {
          "基础描述": "今日正财当值，代表稳定的财富运势。通过正当途径获得的收入会比较理想，适合进行稳健的理财活动。",
          "收入稳定": "工资、业务收入等正当收入来源比较稳定，有机会获得加薪或奖金。",
          "投资理财": "适合进行稳健的投资理财，如银行理财产品、债券等低风险投资。",
          "商业机会": "在商业活动中容易获得稳定的利润，适合开展长期的商业合作。",
          "消费理性": "对金钱的使用比较理性，能够做到量入为出，积累财富。"
        },
        "理财建议": {
          "储蓄计划": "制定合理的储蓄计划，为未来的发展和应急需要做好准备。",
          "投资策略": "选择稳健的投资产品，注重长期收益而不是短期暴利。",
          "预算管理": "做好家庭或个人预算，合理分配收入，控制不必要的支出。"
        },
        "发展机会": {
          "事业发展": "财运的稳定有助于事业的发展，可以考虑投资自己的技能提升或事业扩展。",
          "生活品质": "在财务允许的范围内适当提升生活品质，但要避免过度消费。"
        }
      },
      "偏财": {
        "意外之财": {
          "基础描述": "今日偏财当值，代表有意外收入的可能性。可能通过投资、彩票、奖金等方式获得额外的财富。",
          "投资机会": "有机会遇到不错的投资机会，但要仔细分析风险，不要盲目跟风。",
          "意外收入": "可能收到意外的钱财，如奖金、退款、礼金等，要合理规划使用。",
          "商业直觉": "对市场机会的嗅觉比较敏锐，适合进行一些短期的商业投资。",
          "人际财运": "通过人际关系可能获得财富机会，朋友介绍的生意或投资值得关注。"
        },
        "风险提醒": {
          "投机警示": "虽然有偏财运，但不要过度投机，要在自己承受能力范围内投资。",
          "诈骗防范": "要警惕各种投资诈骗和金融陷阱，不要被高收益承诺迷惑。",
          "理性决策": "遇到投资机会时要冷静分析，不要因为一时的兴奋而做出错误决定。"
        },
        "行动建议": {
          "机会把握": "对于确实不错的投资机会，可以适当参与，但要控制投资比例。",
          "风险管理": "建立风险评估机制，投资前要充分了解产品特性和风险等级。",
          "收益规划": "如果获得意外收入，要合理规划使用，不要全部用于消费或再投资。"
        }
      },
      "正官": {
        "贵人相助": {
          "基础描述": "今日正官当值，代表权威和贵人的支持。在工作和生活中容易得到上级或有影响力人士的帮助和认可。",
          "事业发展": "工作表现容易得到上级的认可，有升职加薪的机会。适合向领导汇报工作成果。",
          "权威支持": "容易获得权威人士的支持和指导，要珍惜这样的机会，虚心学习。",
          "规则遵守": "严格遵守规章制度会带来好的结果，按规矩办事能够获得认可。",
          "社会地位": "社会地位和声誉有提升的机会，要注意维护自己的形象和品德。"
        },
        "行为准则": {
          "诚信正直": "保持诚信正直的品格，以德服人，建立良好的个人声誉。",
          "责任担当": "勇于承担责任，在工作中展现出可靠和负责的态度。",
          "学习提升": "向有经验的前辈学习，提升自己的专业能力和管理水平。"
        },
        "发展方向": {
          "管理发展": "有机会向管理岗位发展，要培养领导能力和团队协作精神。",
          "专业提升": "在专业领域深耕细作，建立权威地位和专业声誉。",
          "社会责任": "承担更多的社会责任，在回报社会的同时提升自己的影响力。"
        }
      },
      "七杀": {
        "压力挑战": {
          "基础描述": "今日七杀当值，代表面临较大的压力和挑战。需要拿出勇气和决心来应对困难，化压力为动力。",
          "工作压力": "工作中可能遇到严厉的上级或苛刻的要求，要保持冷静，用实力证明自己。",
          "竞争激烈": "面临激烈的竞争环境，要发挥出自己的潜力和斗志来应对挑战。",
          "决策重要": "可能需要做出重要的决策，要慎重考虑，承担相应的责任。",
          "自我突破": "压力虽大，但也是自我突破和成长的机会，要保持积极的心态。"
        },
        "应对策略": {
          "能力提升": "加强自身能力建设，提升专业技能和综合素质。",
          "心理调节": "学会压力管理和心理调节，保持良好的精神状态。",
          "策略思考": "面对挑战要有策略思考，寻找最佳的解决方案。"
        },
        "成长机会": {
          "潜力激发": "在压力下能够激发出平时没有的潜力和能力，是快速成长的重要机会。",
          "意志锻炼": "困难和挑战能够锻炼意志力和抗压能力，增强心理素质。",
          "经验积累": "在应对挑战的过程中积累宝贵经验，为未来的发展奠定基础。"
        }
      },
      "正印": {
        "学习成长": {
          "基础描述": "今日正印当值，代表学习和成长的能量特别强。容易得到长辈的关爱和指导，适合进行学习和自我提升活动。",
          "学习运势": "学习能力强，理解力和记忆力都很好。适合参加培训、考试或深度学习。",
          "贵人指导": "容易遇到好的老师或导师，得到有价值的指导和帮助。",
          "智慧增长": "思维清晰，洞察力强，能够从经验中总结出有用的智慧。",
          "文化修养": "适合提升文化修养和精神层面的追求，如读书、修行等。"
        },
        "发展建议": {
          "学习计划": "制定系统的学习计划，利用这个有利时机提升自己的知识和技能。",
          "导师关系": "主动寻求有经验人士的指导，建立良好的师生关系。",
          "知识应用": "将学到的知识及时应用到实践中，实现知行合一。"
        }
      },
      "偏印": {
        "思维敏捷": {
          "基础描述": "今日偏印当值，代表思维敏捷但容易多疑。具有很强的洞察力和直觉，但要注意不要过度猜疑。",
          "直觉敏锐": "直觉和第六感特别强，能够敏感地察觉到他人的想法和环境的变化。",
          "分析能力": "逻辑分析能力强，善于从复杂的信息中找出关键点和规律。",
          "创新思维": "思维方式独特，容易产生创新的想法和解决方案。",
          "研究天赋": "适合进行研究和探索性工作，在学术或技术领域有发展潜力。"
        },
        "注意事项": {
          "过度猜疑": "要控制过度猜疑的倾向，不要无端怀疑他人的动机。",
          "情绪管理": "情绪变化较快，要学会稳定情绪，保持内心平静。",
          "人际关系": "在人际交往中要更加开放和信任，避免因猜疑而影响关系。"
        }
      }
    },
    "节气运势": {
      "立春": {
        "seasonal_energy": "万物复苏的能量，适合开始新的计划和项目。",
        "health_advice": "注意防风保暖，多食用温性食物，适合进行轻度运动。",
        "career_guidance": "适合启动新项目，制定年度计划，展现创新思维。",
        "relationship_tips": "人际关系回暖，适合修复旧关系，建立新联系。"
      },
      "雨水": {
        "seasonal_energy": "滋润生长的能量，适合培养新习惯和技能。",
        "health_advice": "注意祛湿健脾，少食生冷，保持适度运动。",
        "career_guidance": "适合学习新技能，培养专业能力，稳步发展。",
        "relationship_tips": "感情需要细心呵护，用心沟通能增进理解。"
      },
      "夏至": {
        "seasonal_energy": "阳气最盛的时期，适合展现才华和实现目标。",
        "health_advice": "注意避暑降火，多饮水，避免过度劳累。",
        "career_guidance": "事业发展的高峰期，适合争取更高的目标和成就。",
        "relationship_tips": "感情热烈，但要注意控制情绪，避免过度激动。"
      },
      "冬至": {
        "seasonal_energy": "阴气最盛但阳气开始回升，适合内省和规划。",
        "health_advice": "注意保暖补阳，多食温补食物，早睡晚起。",
        "career_guidance": "适合总结反思，制定长远规划，蓄积力量。",
        "relationship_tips": "感情需要温暖呵护，家庭和睦最为重要。"
      }
    },
    "五行调和建议": {
      "木旺": {
        "调和方法": "适当增加金的元素来调节，如佩戴金属饰品，选择白色系服装。",
        "生活建议": "多进行冷静思考，控制冲动情绪，在决策时要更加理性。",
        "健康养生": "注意肝胆保养，少食辛辣，多做舒缓运动如太极、瑜伽。"
      },
      "火旺": {
        "调和方法": "适当增加水的元素来调节，如多饮水，选择黑色蓝色系搭配。",
        "生活建议": "控制急躁情绪，避免冲动决策，培养耐心和冷静。",
        "健康养生": "注意心血管保养，避免过度兴奋，保持充足睡眠。"
      },
      "土旺": {
        "调和方法": "适当增加木的元素来调节，如接触绿色植物，选择绿色系装饰。",
        "生活建议": "增强创新思维，避免过于保守，适当接受新事物和变化。",
        "健康养生": "注意脾胃保养，适度运动，避免暴饮暴食。"
      },
      "金旺": {
        "调和方法": "适当增加火的元素来调节，如多晒太阳，选择红色系装饰。",
        "生活建议": "增加热情和感性思维，在理性的基础上适当感性决策。",
        "健康养生": "注意呼吸系统保养，适当进行有氧运动，保持心情愉悦。"
      },
      "水旺": {
        "调和方法": "适当增加土的元素来调节，如接触大自然，选择黄色系装饰。",
        "生活建议": "增强稳定性和执行力，避免过于飘忽，制定具体计划。",
        "健康养生": "注意肾脏保养，避免过度劳累，保持规律作息。"
      }
    }
  },
  "usage_guidelines": {
    "template_selection": "根据当日十神关系、节气、用户五行强弱来选择对应的运势模板",
    "content_combination": "可以组合多个维度的内容生成综合性的运势分析",
    "personalization": "根据用户年龄、性别、职业等信息进一步个性化调整建议",
    "update_frequency": "建议每日更新运势内容，每季度更新模板库"
  },
  "api_integration": {
    "fortune_calculator_integration": "与FortuneCalculator类的运势计算功能深度集成",
    "bazi_calculator_cooperation": "与BaziCalculator类配合使用，提供完整的八字运势分析",
    "caching_strategy": "支持运势模板缓存，提升API响应速度",
    "real_time_calculation": "支持实时计算当日运势，确保时效性"
  }
}
